TexasInstruments/mcal_am263x/mcal/include/hw/am2732s/hw_adc.h
/*
 *  Copyright (c) Texas Instruments Incorporated 2021
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**
 *
 *  \file hw_adc.h
 *
 *  \brief
 *     The file contains the register layer definitons for the
 *     GPADC Module.
 *
 *
 */

/****************************************************************************************
 * FILE INCLUSION PROTECTION
 ****************************************************************************************
 */
#ifndef HW_ADC_H
#define HW_ADC_H

/****************************************************************************************
 * INCLUDE FILES
 ****************************************************************************************
 */
#include "Std_Types.h"
/****************************************************************************************
 * MACROS
 ****************************************************************************************
 */

/* Base Address*/

#define MSS_RCM_BASE_ADDRESS                   (0x02100000U)
#define MSS_GPADC_REG_BASE_ADDRESS             (0x03F79800U)
#define MSS_TOPRCM_BASE_ADDRESS                (0x02140000U)
#define MSS_TOP_CTRL_BASE_ADDRESS              (0x030E0000U)

/*MSS_RCM_REG_ADDR_OFFSET*/

#define MSS_GPADC_CLK_DIV_VAL_ADDR_OFFSET         (0x00000098U)
#define MSS_GPADC_CLK_GATE_ADDR_OFFSET            (0x000000E0U)
#define MSS_GPADC_RST_CTRL_ADDR_OFFSET            (0x000001ACU)

/*MSS_TOPRCM_REG_ADDR_OFFSET*/

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ADDR_OFFSET             (0x00000C34U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_ADDR_OFFSET             (0x00000C24U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADDR_OFFSET                  (0x00000C30U)

/*MSS_GPADC_REG_OFFSET*/

#define R_REG0_ADDR_OFFSET                        (0x00000000U)
#define R_REG1_ADDR_OFFSET                        (0x00000004U)
#define R_REG2_ADDR_OFFSET                        (0x00000008U)
#define R_REG3_ADDR_OFFSET                        (0x0000000CU)
#define R_REG4_ADDR_OFFSET                        (0x00000010U)
#define R_REG5_ADDR_OFFSET                        (0x00000014U)
#define R_REG6_ADDR_OFFSET                        (0x00000018U)
#define R_REG7_ADDR_OFFSET                        (0x0000001CU)
#define R_REG8_ADDR_OFFSET                        (0x00000020U)
#define R_REG14_ADDR_OFFSET                       (0x00000038U)
#define R_REG15_ADDR_OFFSET                       (0x0000003CU)
#define R_REG17_ADDR_OFFSET                       (0x00000044U)
#define R_REG18_ADDR_OFFSET                       (0x00000048U)

/*TOP_CTRL_REG_ADDR_OFFSET*/

#define EFUSE1_ROW_14_ADDR_OFFSET                 (0x00000430U)
#define EFUSE1_ROW_33_ADDR_OFFSET                 (0x0000047CU)
#define EFUSE1_ROW_34_ADDR_OFFSET                 (0x00000480U)
#define EFUSE1_ROW_35_ADDR_OFFSET                 (0x00000484U)
#define EFUSE1_ROW_36_ADDR_OFFSET                 (0x00000488U)
#define EFUSE1_ROW_37_ADDR_OFFSET                 (0x0000048CU)
#define EFUSE1_ROW_38_ADDR_OFFSET                 (0x00000490U)
#define EFUSE1_ROW_39_ADDR_OFFSET                 (0x00000494U)


/* MSS_GPADC_CLK_DIV_VAL */

#define MSS_GPADC_CLK_DIV_VAL_CLKDIVR_MASK   (0x00FFFFFFU)
#define MSS_GPADC_CLK_DIV_VAL_CLKDIVR_SHIFT  (0x00000000U)
#define MSS_GPADC_CLK_DIV_VAL_CLKDIVR_RESETVAL (0x00000000U)
#define MSS_GPADC_CLK_DIV_VAL_CLKDIVR_MAX    (0x00FFFFFFU)

#define MSS_GPADC_CLK_DIV_VAL_RESETVAL                             (0x00000000U)

/* MSS_GPADC_CLK_GATE */

#define MSS_GPADC_CLK_GATE_GATED_MASK           (0x00000007U)
#define MSS_GPADC_CLK_GATE_GATED_SHIFT          (0x00000000U)
#define MSS_GPADC_CLK_GATE_GATED_RESETVAL       (0x00000000U)
#define MSS_GPADC_CLK_GATE_GATED_MAX            (0x00000007U)

#define MSS_GPADC_CLK_GATE_RESETVAL                                (0x00000000U)

/* MSS_GPADC_CLK_STATUS */

#define MSS_GPADC_CLK_STATUS_CURRDIVIDER_MASK (0x0000FF00U)
#define MSS_GPADC_CLK_STATUS_CURRDIVIDER_SHIFT (0x00000008U)
#define MSS_GPADC_CLK_STATUS_CURRDIVIDER_RESETVAL (0x00000000U)
#define MSS_GPADC_CLK_STATUS_CURRDIVIDER_MAX  (0x000000FFU)

#define MSS_GPADC_CLK_STATUS_RESETVAL                              (0x00000000U)

/* MSS_GPADC_RST_CTRL */

#define MSS_GPADC_RST_CTRL_ASSERT_MASK          (0x00000007U)
#define MSS_GPADC_RST_CTRL_ASSERT_SHIFT         (0x00000000U)
#define MSS_GPADC_RST_CTRL_ASSERT_RESETVAL      (0x00000000U)
#define MSS_GPADC_RST_CTRL_ASSERT_MAX           (0x00000007U)

#define MSS_GPADC_RST_CTRL_RESETVAL                                (0x00000000U)

/* GPADC_CTRL */

