TexasInstruments/mcal_am263x/mcal/include/hw/am2732s/hw_adc.h
#define GPADC_CTRL_GPADC_SW_TRIG_MASK                  (0x00000001U)
#define GPADC_CTRL_GPADC_SW_TRIG_SHIFT                 (0x00000000U)
#define GPADC_CTRL_GPADC_SW_TRIG_RESETVAL              (0x00000000U)
#define GPADC_CTRL_GPADC_SW_TRIG_MAX                   (0x00000001U)

#define GPADC_CTRL_GPADC_TRIGIN_SEL_MASK               (0x00001F00U)
#define GPADC_CTRL_GPADC_TRIGIN_SEL_SHIFT              (0x00000008U)
#define GPADC_CTRL_GPADC_TRIGIN_SEL_RESETVAL           (0x0000000FU)
#define GPADC_CTRL_GPADC_TRIGIN_SEL_MAX                (0x0000001FU)

#define GPADC_CTRL_RESETVAL                                       (0x00000F00U)

/* MSS_GPADC_MEM_INIT */

#define MSS_GPADC_MEM_INIT_MEM0_INIT_MASK      (0x00000001U)
#define MSS_GPADC_MEM_INIT_MEM0_INIT_SHIFT     (0x00000000U)
#define MSS_GPADC_MEM_INIT_MEM0_INIT_RESETVAL  (0x00000000U)
#define MSS_GPADC_MEM_INIT_MEM0_INIT_MAX       (0x00000001U)

#define MSS_GPADC_MEM_INIT_RESETVAL                               (0x00000000U)

/* MSS_GPADC_MEM_INIT_DONE */

#define MSS_GPADC_MEM_INIT_DONE_MEM0_DONE_MASK (0x00000001U)
#define MSS_GPADC_MEM_INIT_DONE_MEM0_DONE_SHIFT (0x00000000U)
#define MSS_GPADC_MEM_INIT_DONE_MEM0_DONE_RESETVAL (0x00000000U)
#define MSS_GPADC_MEM_INIT_DONE_MEM0_DONE_MAX (0x00000001U)

#define MSS_GPADC_MEM_INIT_DONE_RESETVAL                          (0x00000000U)

/* MSS_GPADC_MEM_INIT_STATUS */

#define MSS_GPADC_MEM_INIT_STATUS_MEM0_STATUS_MASK (0x00000001U)
#define MSS_GPADC_MEM_INIT_STATUS_MEM0_STATUS_SHIFT (0x00000000U)
#define MSS_GPADC_MEM_INIT_STATUS_MEM0_STATUS_RESETVAL (0x00000000U)
#define MSS_GPADC_MEM_INIT_STATUS_MEM0_STATUS_MAX (0x00000001U)

#define MSS_GPADC_MEM_INIT_STATUS_RESETVAL                        (0x00000000U)

/* ANA_REG_TW_CTRL_REG_LOWV */

#define ANA_REG_TW_CTRL_REG_LOWV_ADC_EN_MASK                    (0x00000001U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_EN_SHIFT                   (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_EN_RESETVAL                (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_EN_MAX                     (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_ADC_START_CONV_MASK            (0x00000002U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_START_CONV_SHIFT           (0x00000001U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_START_CONV_RESETVAL        (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_START_CONV_MAX             (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_ADC_RESET_MASK                 (0x00000004U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_RESET_SHIFT                (0x00000002U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_RESET_RESETVAL             (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_RESET_MAX                  (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_ADC_INP_BUF_EN_MASK            (0x00000008U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_INP_BUF_EN_SHIFT           (0x00000003U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_INP_BUF_EN_RESETVAL        (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_INP_BUF_EN_MAX             (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_ADC_REF_BUF_EN_MASK            (0x00000010U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_REF_BUF_EN_SHIFT           (0x00000004U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_REF_BUF_EN_RESETVAL        (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_REF_BUF_EN_MAX             (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_ADC_REF_SEL_2_0_MASK           (0x000000E0U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_REF_SEL_2_0_SHIFT          (0x00000005U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_REF_SEL_2_0_RESETVAL       (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ADC_REF_SEL_2_0_MAX            (0x00000007U)

#define ANA_REG_TW_CTRL_REG_LOWV_TS_DIFF_INP_BUF_EN_MASK        (0x00000100U)
#define ANA_REG_TW_CTRL_REG_LOWV_TS_DIFF_INP_BUF_EN_SHIFT       (0x00000008U)
#define ANA_REG_TW_CTRL_REG_LOWV_TS_DIFF_INP_BUF_EN_RESETVAL    (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_TS_DIFF_INP_BUF_EN_MAX         (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_TS_SE_INP_BUF_EN_MASK          (0x00000200U)
#define ANA_REG_TW_CTRL_REG_LOWV_TS_SE_INP_BUF_EN_SHIFT         (0x00000009U)
#define ANA_REG_TW_CTRL_REG_LOWV_TS_SE_INP_BUF_EN_RESETVAL      (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_TS_SE_INP_BUF_EN_MAX           (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_IFORCE_EXT_CTRL_MASK           (0x00000400U)
#define ANA_REG_TW_CTRL_REG_LOWV_IFORCE_EXT_CTRL_SHIFT          (0x0000000AU)
#define ANA_REG_TW_CTRL_REG_LOWV_IFORCE_EXT_CTRL_RESETVAL       (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_IFORCE_EXT_CTRL_MAX            (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_VREF_EXT_CTRL_MASK             (0x00000800U)
#define ANA_REG_TW_CTRL_REG_LOWV_VREF_EXT_CTRL_SHIFT            (0x0000000BU)
#define ANA_REG_TW_CTRL_REG_LOWV_VREF_EXT_CTRL_RESETVAL         (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_VREF_EXT_CTRL_MAX              (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_VIN_EXT_CTRL_MASK              (0x00001000U)
#define ANA_REG_TW_CTRL_REG_LOWV_VIN_EXT_CTRL_SHIFT             (0x0000000CU)
#define ANA_REG_TW_CTRL_REG_LOWV_VIN_EXT_CTRL_RESETVAL          (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_VIN_EXT_CTRL_MAX               (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_ANA_TMUX_BUF_BYPASS_MASK       (0x00002000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ANA_TMUX_BUF_BYPASS_SHIFT      (0x0000000DU)
#define ANA_REG_TW_CTRL_REG_LOWV_ANA_TMUX_BUF_BYPASS_RESETVAL   (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ANA_TMUX_BUF_BYPASS_MAX        (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_ANA_TMUX_BUF_EN_MASK           (0x00004000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ANA_TMUX_BUF_EN_SHIFT          (0x0000000EU)
#define ANA_REG_TW_CTRL_REG_LOWV_ANA_TMUX_BUF_EN_RESETVAL       (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_ANA_TMUX_BUF_EN_MAX            (0x00000001U)

#define ANA_REG_TW_CTRL_REG_LOWV_RTRIM_TW_4_0_MASK              (0x000F8000U)
#define ANA_REG_TW_CTRL_REG_LOWV_RTRIM_TW_4_0_SHIFT             (0x0000000FU)
#define ANA_REG_TW_CTRL_REG_LOWV_RTRIM_TW_4_0_RESETVAL          (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_RTRIM_TW_4_0_MAX               (0x0000001FU)

#define ANA_REG_TW_CTRL_REG_LOWV_RESERVED1_MASK                 (0xFFF00000U)
#define ANA_REG_TW_CTRL_REG_LOWV_RESERVED1_SHIFT                (0x00000014U)
#define ANA_REG_TW_CTRL_REG_LOWV_RESERVED1_RESETVAL             (0x00000000U)
#define ANA_REG_TW_CTRL_REG_LOWV_RESERVED1_MAX                  (0x00000FFFU)

#define ANA_REG_TW_CTRL_REG_LOWV_RESETVAL                       (0x00000000U)

/* ANA_REG_TW_ANA_TMUX_CTRL_LOWV */

