TexasInstruments/mcal_am263x/mcal/include/hw/am2732s/hw_adc.h
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_WU_ANA_TEST_OUT_1P8V_MASK (0x00000001U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_WU_ANA_TEST_OUT_1P8V_SHIFT (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_WU_ANA_TEST_OUT_1P8V_RESETVAL (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_WU_ANA_TEST_OUT_1P8V_MAX  (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_REFSYS_TEST_OUT_1P8V_MASK (0x00000002U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_REFSYS_TEST_OUT_1P8V_SHIFT (0x00000001U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_REFSYS_TEST_OUT_1P8V_RESETVAL (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_REFSYS_TEST_OUT_1P8V_MAX  (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_2_MASK         (0x00000004U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_2_SHIFT        (0x00000002U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_2_RESETVAL     (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_2_MAX          (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_3_MASK         (0x00000008U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_3_SHIFT        (0x00000003U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_3_RESETVAL     (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_3_MAX          (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_4_MASK         (0x00000010U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_4_SHIFT        (0x00000004U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_4_RESETVAL     (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_4_MAX          (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_5_MASK         (0x00000020U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_5_SHIFT        (0x00000005U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_5_RESETVAL     (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_PM_ANA_INP_5_MAX          (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_S_BUFF_MASK           (0x00000040U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_S_BUFF_SHIFT          (0x00000006U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_S_BUFF_RESETVAL       (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_S_BUFF_MAX            (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_W_BUFF_MASK           (0x00000080U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_W_BUFF_SHIFT          (0x00000007U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_W_BUFF_RESETVAL       (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_W_BUFF_MAX            (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_DC_BIST_BUF_INP_1P8V_MASK (0x00000100U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_DC_BIST_BUF_INP_1P8V_SHIFT (0x00000008U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_DC_BIST_BUF_INP_1P8V_RESETVAL (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_DC_BIST_BUF_INP_1P8V_MAX  (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ADC_BUF_OUT_1P8V_MASK     (0x00000200U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ADC_BUF_OUT_1P8V_SHIFT    (0x00000009U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ADC_BUF_OUT_1P8V_RESETVAL (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ADC_BUF_OUT_1P8V_MAX      (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ADC_REF_BUF_OUT_MASK      (0x00000400U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ADC_REF_BUF_OUT_SHIFT     (0x0000000AU)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ADC_REF_BUF_OUT_RESETVAL  (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ADC_REF_BUF_OUT_MAX       (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_DELVBE_BUFF_OUT_MASK      (0x00000800U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_DELVBE_BUFF_OUT_SHIFT     (0x0000000BU)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_DELVBE_BUFF_OUT_RESETVAL  (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_DELVBE_BUFF_OUT_MAX       (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_TS_STRONG_MASK        (0x00001000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_TS_STRONG_SHIFT       (0x0000000CU)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_TS_STRONG_RESETVAL    (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_TS_STRONG_MAX         (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_TS_WEAK_MASK          (0x00002000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_TS_WEAK_SHIFT         (0x0000000DU)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_TS_WEAK_RESETVAL      (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_VBE_TS_WEAK_MAX           (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ODP_MASK                  (0x00004000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ODP_SHIFT                 (0x0000000EU)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ODP_RESETVAL              (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ODP_MAX                   (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_BIST_MUX_OUT_1P8V_MASK    (0x00008000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_BIST_MUX_OUT_1P8V_SHIFT   (0x0000000FU)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_BIST_MUX_OUT_1P8V_RESETVAL (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_BIST_MUX_OUT_1P8V_MAX     (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_I2V_SENSE_MASK            (0x00010000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_I2V_SENSE_SHIFT           (0x00000010U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_I2V_SENSE_RESETVAL        (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_I2V_SENSE_MAX             (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_TMUX_BUF_OUT_EN_MASK      (0x00020000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_TMUX_BUF_OUT_EN_SHIFT     (0x00000011U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_TMUX_BUF_OUT_EN_RESETVAL  (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_TMUX_BUF_OUT_EN_MAX       (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ATESTV_VSLDO_MASK         (0x00040000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ATESTV_VSLDO_SHIFT        (0x00000012U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ATESTV_VSLDO_RESETVAL     (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ATESTV_VSLDO_MAX          (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_RESERVED0_MASK            (0x3FF80000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_RESERVED0_SHIFT           (0x00000013U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_RESERVED0_RESETVAL        (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_RESERVED0_MAX             (0x000007FFU)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_CLK_TMUX_ESD_CTRL_MASK    (0x40000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_CLK_TMUX_ESD_CTRL_SHIFT   (0x0000001EU)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_CLK_TMUX_ESD_CTRL_RESETVAL (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_CLK_TMUX_ESD_CTRL_MAX     (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ANA_TEST_EN_MASK          (0x80000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ANA_TEST_EN_SHIFT         (0x0000001FU)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ANA_TEST_EN_RESETVAL      (0x00000000U)
#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_ANA_TEST_EN_MAX           (0x00000001U)

#define ANA_REG_TW_ANA_TMUX_CTRL_LOWV_RESETVAL                  (0x00000000U)


