TexasInstruments/mcal_am263x/mcal/include/hw/am2732s/hw_adc.h
/* ANA_REG_REFSYS_SPARE_REG_LOWV */

#define ANA_REG_REFSYS_SPARE_REG_LOWV_POR_DIG_SEQ_ECO_DIS_MASK  (0x00000001U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_POR_DIG_SEQ_ECO_DIS_SHIFT (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_POR_DIG_SEQ_ECO_DIS_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_POR_DIG_SEQ_ECO_DIS_MAX   (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED_0_MASK           (0x0000003EU)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED_0_SHIFT          (0x00000001U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED_0_RESETVAL       (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED_0_MAX            (0x0000001FU)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_SR_SEL_MASK           (0x000000C0U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_SR_SEL_SHIFT          (0x00000006U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_SR_SEL_RESETVAL       (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_SR_SEL_MAX            (0x00000003U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_UV_SELF_TEST_SEL_MASK (0x00000100U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_UV_SELF_TEST_SEL_SHIFT (0x00000008U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_UV_SELF_TEST_SEL_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_UV_SELF_TEST_SEL_MAX  (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_SELF_TEST_SEL_MASK (0x00000200U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_SELF_TEST_SEL_SHIFT (0x00000009U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_SELF_TEST_SEL_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_SELF_TEST_SEL_MAX  (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_UV_SELF_TEST_SEL_MASK (0x00000400U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_UV_SELF_TEST_SEL_SHIFT (0x0000000AU)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_UV_SELF_TEST_SEL_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_UV_SELF_TEST_SEL_MAX (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED0_MASK            (0x00000800U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED0_SHIFT           (0x0000000BU)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED0_RESETVAL        (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED0_MAX             (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDS_3P3V_UV_SELF_TEST_SEL_MASK (0x00001000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDS_3P3V_UV_SELF_TEST_SEL_SHIFT (0x0000000CU)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDS_3P3V_UV_SELF_TEST_SEL_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDS_3P3V_UV_SELF_TEST_SEL_MAX (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED1_MASK            (0x00002000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED1_SHIFT           (0x0000000DU)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED1_RESETVAL        (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESERVED1_MAX             (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_IR_DROP_COMP_SEL_MASK (0x0000C000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_IR_DROP_COMP_SEL_SHIFT (0x0000000EU)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_IR_DROP_COMP_SEL_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_IR_DROP_COMP_SEL_MAX (0x00000003U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_SR_SEL_MASK        (0x00030000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_SR_SEL_SHIFT       (0x00000010U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_SR_SEL_RESETVAL    (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_SR_SEL_MAX         (0x00000003U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VIOIN_UV_RSET_MASK_MASK   (0x00040000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VIOIN_UV_RSET_MASK_SHIFT  (0x00000012U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VIOIN_UV_RSET_MASK_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VIOIN_UV_RSET_MASK_MAX    (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_UV_RSET_MASK_MASK (0x00080000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_UV_RSET_MASK_SHIFT (0x00000013U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_UV_RSET_MASK_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_UV_RSET_MASK_MAX (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_UV_RSET_MASK_MASK     (0x00100000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_UV_RSET_MASK_SHIFT    (0x00000014U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_UV_RSET_MASK_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_UV_RSET_MASK_MAX      (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_RSET_MASK_MASK     (0x00200000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_RSET_MASK_SHIFT    (0x00000015U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_RSET_MASK_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_OV_RSET_MASK_MAX      (0x00000001U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_IR_DROP_COMP_SEL_MASK (0x00C00000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_IR_DROP_COMP_SEL_SHIFT (0x00000016U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_IR_DROP_COMP_SEL_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDD_IR_DROP_COMP_SEL_MAX  (0x00000003U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDS_3P3V_IR_DROP_COMP_SEL_MASK (0x03000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDS_3P3V_IR_DROP_COMP_SEL_SHIFT (0x00000018U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDS_3P3V_IR_DROP_COMP_SEL_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDS_3P3V_IR_DROP_COMP_SEL_MAX (0x00000003U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_IR_DROP_COMP_SEL_MASK (0x0C000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_IR_DROP_COMP_SEL_SHIFT (0x0000001AU)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_IR_DROP_COMP_SEL_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_VDDA_OSC_IR_DROP_COMP_SEL_MAX (0x00000003U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_REFSYS_SPARE_30_28_MASK   (0x70000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_REFSYS_SPARE_30_28_SHIFT  (0x0000001CU)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_REFSYS_SPARE_30_28_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_REFSYS_SPARE_30_28_MAX    (0x00000007U)

#define ANA_REG_REFSYS_SPARE_REG_LOWV_ANALOGTEST_TMUX_ESD_CTRL_MASK (0x80000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_ANALOGTEST_TMUX_ESD_CTRL_SHIFT (0x0000001FU)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_ANALOGTEST_TMUX_ESD_CTRL_RESETVAL (0x00000000U)
#define ANA_REG_REFSYS_SPARE_REG_LOWV_ANALOGTEST_TMUX_ESD_CTRL_MAX (0x00000001U)

