TexasInstruments/mcal_am263x/mcal/include/hw/am2732s/hw_adc.h
#define ANA_REG_REFSYS_SPARE_REG_LOWV_RESETVAL                  (0x00000000U)

/* GPADC_REG_R_REG0 */

#define GPADC_REG_R_REG0_DCBIST_MODE_MASK   (0x00000003U)
#define GPADC_REG_R_REG0_DCBIST_MODE_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG0_DCBIST_MODE_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG0_DCBIST_MODE_MAX    (0x00000003U)

#define GPADC_REG_R_REG0_GPADC_FSM_CLK_ENABLE_MASK   (0x00000100U)
#define GPADC_REG_R_REG0_GPADC_FSM_CLK_ENABLE_SHIFT  (0x00000008U)
#define GPADC_REG_R_REG0_GPADC_FSM_CLK_ENABLE_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG0_GPADC_FSM_CLK_ENABLE_MAX    (0x00000001U)

#define GPADC_REG_R_REG0_GPADC2ADCBUF_PATH_EN_MASK   (0x00000E00U)
#define GPADC_REG_R_REG0_GPADC2ADCBUF_PATH_EN_SHIFT  (0x00000009U)
#define GPADC_REG_R_REG0_GPADC2ADCBUF_PATH_EN_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG0_GPADC2ADCBUF_PATH_EN_MAX    (0x00000007U)

#define GPADC_REG_R_REG0_GPADC_DEBUG_MODE_ENABLE_MASK   (0x00010000U)
#define GPADC_REG_R_REG0_GPADC_DEBUG_MODE_ENABLE_SHIFT  (0x00000010U)
#define GPADC_REG_R_REG0_GPADC_DEBUG_MODE_ENABLE_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG0_GPADC_DEBUG_MODE_ENABLE_MAX    (0x00000001U)

#define GPADC_REG_R_REG0_RESETVAL                          (0x00000000U)

/* GPADC_REG_R_REG1 */

#define GPADC_REG_R_REG1_GPADC_TRIGGER_MASK   (0x00000001U)
#define GPADC_REG_R_REG1_GPADC_TRIGGER_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG1_GPADC_TRIGGER_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG1_GPADC_TRIGGER_MAX    (0x00000001U)

#define GPADC_REG_R_REG1_GPADC_INIT_MASK   (0x00000100U)
#define GPADC_REG_R_REG1_GPADC_INIT_SHIFT  (0x00000008U)
#define GPADC_REG_R_REG1_GPADC_INIT_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG1_GPADC_INIT_MAX    (0x00000001U)

#define GPADC_REG_R_REG1_GPADC_FSM_BYPASS_MASK   (0x00010000U)
#define GPADC_REG_R_REG1_GPADC_FSM_BYPASS_SHIFT  (0x00000010U)
#define GPADC_REG_R_REG1_GPADC_FSM_BYPASS_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG1_GPADC_FSM_BYPASS_MAX    (0x00000001U)

#define GPADC_REG_R_REG1_GPADC_START_BYP_VAL_MASK   (0x01000000U)
#define GPADC_REG_R_REG1_GPADC_START_BYP_VAL_SHIFT  (0x00000018U)
#define GPADC_REG_R_REG1_GPADC_START_BYP_VAL_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG1_GPADC_START_BYP_VAL_MAX    (0x00000001U)

#define GPADC_REG_R_REG1_RESETVAL                          (0x00000000U)

/* GPADC_REG_R_REG2 */

#define GPADC_REG_R_REG2_CONFIG_VALUE_IFM_MASK   (0xFFFFFFFFU)
#define GPADC_REG_R_REG2_CONFIG_VALUE_IFM_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG2_CONFIG_VALUE_IFM_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG2_CONFIG_VALUE_IFM_MAX    (0xFFFFFFFFU)

#define GPADC_REG_R_REG2_RESETVAL                          (0x00000000U)


/* GPADC_REG_R_REG3 */

#define GPADC_REG_R_REG3_PARAM_VAL_IFM_MASK   (0x000000FFU)
#define GPADC_REG_R_REG3_PARAM_VAL_IFM_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG3_PARAM_VAL_IFM_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG3_PARAM_VAL_IFM_MAX    (0x000000FFU)

#define GPADC_REG_R_REG3_COLLECT_SAMPLES_IFM_MASK   (0x0000FF00U)
#define GPADC_REG_R_REG3_COLLECT_SAMPLES_IFM_SHIFT  (0x00000008U)
#define GPADC_REG_R_REG3_COLLECT_SAMPLES_IFM_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG3_COLLECT_SAMPLES_IFM_MAX    (0x000000FFU)

#define GPADC_REG_R_REG3_SKIP_SAMPLES_IFM_MASK   (0x007F0000U)
#define GPADC_REG_R_REG3_SKIP_SAMPLES_IFM_SHIFT  (0x00000010U)
#define GPADC_REG_R_REG3_SKIP_SAMPLES_IFM_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG3_SKIP_SAMPLES_IFM_MAX    (0x0000007FU)

#define GPADC_REG_R_REG3_PARAM_IFM_MASK   (0x007FFFFFU)
#define GPADC_REG_R_REG3_PARAM_IFM_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG3_PARAM_IFM_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG3_PARAM_IFM_MAX    (0x007FFFFFU)

#define GPADC_REG_R_REG3_RESETVAL                          (0x00000000U)

/* GPADC_REG_R_REG8 */

#define GPADC_REG_R_REG8_GPADC_CLK_DIV_MASK   (0x000000FFU)
#define GPADC_REG_R_REG8_GPADC_CLK_DIV_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG8_GPADC_CLK_DIV_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG8_GPADC_CLK_DIV_MAX    (0x000000FFU)

#define GPADC_REG_R_REG8_GPADC_CLK_ENABLE_MASK   (0x00000100U)
#define GPADC_REG_R_REG8_GPADC_CLK_ENABLE_SHIFT  (0x00000008U)
#define GPADC_REG_R_REG8_GPADC_CLK_ENABLE_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG8_GPADC_CLK_ENABLE_MAX    (0x00000001U)

#define GPADC_REG_R_REG8_RESETVAL                          (0x00000000U)

/* GPADC_REG_R_REG14 */

#define GPADC_REG_R_REG14_SUM_IFM_MASK   (0x000FFFFFU)
#define GPADC_REG_R_REG14_SUM_IFM_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG14_SUM_IFM_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG14_SUM_IFM_MAX    (0x000FFFFFU)

#define GPADC_REG_R_REG14_RESETVAL                          (0x00000000U)

/* GPADC_REG_R_REG15 */

#define GPADC_REG_R_REG15_MIN_GPADC_MASK   (0x000003FFU)
#define GPADC_REG_R_REG15_MIN_GPADC_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG15_MIN_GPADC_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG15_MIN_GPADC_MAX    (0x000003FFU)

#define GPADC_REG_R_REG15_MAX_GPADC_MASK   (0x03FF0000U)
#define GPADC_REG_R_REG15_MAX_GPADC_SHIFT  (0x00000010U)
#define GPADC_REG_R_REG15_MAX_GPADC_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG15_MAX_GPADC_MAX    (0x000003FFU)

#define GPADC_REG_R_REG15_RESETVAL                          (0x00000000U)

/* GPADC_REG_R_REG17 */

#define GPADC_REG_R_REG17_GPADC_IFM_DONE_STATUS_MASK   (0x00000001U)
#define GPADC_REG_R_REG17_GPADC_IFM_DONE_STATUS_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG17_GPADC_IFM_DONE_STATUS_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG17_GPADC_IFM_DONE_STATUS_MAX    (0x00000001U)

#define GPADC_REG_R_REG17_RESETVAL                          (0x00000000U)

/* GPADC_REG_R_REG18 */

#define GPADC_REG_R_REG18_GPADC_IFM_DONE_CLR_MASK   (0x00000001U)
#define GPADC_REG_R_REG18_GPADC_IFM_DONE_CLR_SHIFT  (0x00000000U)
#define GPADC_REG_R_REG18_GPADC_IFM_DONE_CLR_RESETVAL (0x00000000U)
#define GPADC_REG_R_REG18_GPADC_IFM_DONE_CLR_MAX    (0x00000001U)

#define GPADC_REG_R_REG18_RESETVAL                          (0x00000000U)

#endif
/*
 * END OF HW_ADC_H
 */

